Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: Use correct spelling and punctuation
ug: ئىملا ۋە تىنىش بەلگىلىرىنى توغرا ئىشلەتكەن

source: User Name
ug: ئىشلەتكۈچى ئىسمى

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
ug: سۆزلىگۈچىنىڭ جۈملىلەرنى توغرا ئوقۇغانلىقىنى تەكشۈرۈش ئارقىلىق ئىشلەتكۈچىلەر ئىئانە قىلىنغان ئاۋازلارنىڭ توغرىلىقىنى دەلىللەيدۇ.

source: Uyghur
ug: ئۇيغۇرچە

source: Uzbek
ug: ئۆزبېكچە

source: Validated Clips
ug: دەلىللەنگەن ئاۋازلار

source: Validated Hours
ug: دەلىللەنگەن سائەت

source: Validated Hr. Total
ug: ئومۇمىي دەلىللەنگەن سائەت

source: Validate Readings
ug: ئوقۇشنى دەلىللە

source: Validate Readings, Review Transcriptions
ug: ئوقۇشنى دەلىللەپ، خاتىرىنى تەكشۈرىدۇ

source: Validate readings submitted by community members
ug: جامائەت ئەزاسى يوللىغان ئوقۇشنى دەلىللەيدۇ

source: Validate user-recorded readings in your language
ug: ئىشلەتكۈچى خاتىرىلىگەن تىلىڭىزدىكى ئوقۇشنى دەلىللەيدۇ

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
ug: ئىئانە قىلىنغان ئاۋازلارنى دەلىللەش Common Voice ئۈچۈن ئۈچۈن ئوخشاشلا مۇھىم ۋەزىپە. ئاڭلاڭ ۋە سۈپەتلىك ئوچۇق مەنبەلىك ئاۋاز سانلىق مەلۇماتىنى ھاسىل قىلىشىمىزغا ياردەم قىلىڭ.

source: Validation Progress
ug: دەلىللەشنىڭ ئىلگىرىلىشى

source: Validations
ug: دەلىللەش

source: Value and recognition.
ug: قىممەت ۋە تونۇش.

source: Variant Contribution Options
ug: ھەرخىل تۆھپە تاللانمىلىرى

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
ug: ۋارىيانتلار بىر تىلنىڭ، مەسىلەن مەلۇم جۇغراپىيەلىك ماكان ياكى مەلۇم رايوندىكى خەلقلەرنىڭ ئۆزىگە خاس ئالاھىدىلىكى بولۇپ ھېسابلىنىدۇ. بەزىدە بۇلار دىيالېكت دەپمۇ ئاتىلىدۇ.

source: Varying Pronunciations
ug: ھەرخىل تەلەپپۇزلار

source: Venetian
ug: ۋېنداچە

source: Version
ug: نەشرى

source: Very common mistakes include:
ug: كۆپ ئۇچرايدىغان خاتالىقلار:

source: Vietnamese
ug: ۋىيېتنامچە

source: View your progress against personal and project goals.
ug: شەخسىي ۋە تۈر نىشانىدىكى ئىلگىرىلەش ئەھۋالىنى كۆرۈپ بېقىڭ.

source: Visible
ug: كۆرۈنۈشچان

source: Visit our blog or write about us
ug: بىلوگىمىزنى زىيارەت ياكى بىز ھەققىدىكى يازما

source: Voice clips are entered into a submission queue that readies them for listening.
ug: ئاۋازلار ئاڭلاشقا تەييار بولغان تەرتىپىگە يوللاندى.

source: Voice Collection
ug: ئاۋاز توپلىمى

source: Voice Contribution
ug: ئاۋاز تۆھپىسى

source: Voice Dataset, Ready for Download
ug: ئاۋاز ئامبىرى چۈشۈرۈشكە تەييار بولدى

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
ug: ئاۋاز دېمەك تەبىئىيلىك ، ئاۋاز دېمەك ئىنسانلىق. شۇڭلاشقا بىز ماشىنىلار ئۈچۈن ئىشلىتىشچانلىققا ئىگە ئاۋاز تېخنىكىسىنى يارىتىشقا بەل باغلىدۇق. ئەمما ئاۋاز سىستېمىسى بارلىققا كەلتۈرۈش ئۈچۈن، ئىجادكارلار ئىنتايىن كۆپ ئاۋاز مەنبەسىگە ئېھتىياجلىق.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
ug: ئاۋاز دېمەك تەبىئىيلىك ، ئاۋاز دېمەك ئىنسانلىق. شۇڭلاشقا بىز ماشىنىلار ئۈچۈن ئىشلىتىشچانلىققا ئىگە ئاۋاز تېخنىكىسىنى يارىتىشقا قىزىقىمىز. ئەمما ئاۋاز سىستېمىسىنى بارلىققا كەلتۈرۈش ئۈچۈن، ئىنتايىن كۆپ ئاۋاز مەنبەسىگە ئېھتىياجلىق.

source: Voices Online Now
ug: توردىكى ئاۋازلار

source: Voice Validation
ug: ئاۋاز دەلىللەش

source: Volume
ug: ئاۋاز كۈچلۈكلۈكى

source: Votic
ug: ۋوتېچە

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
ug: ئاۋاز توپلاشقا ھەقسىز ۋە ئوچۇق كودلۇق ئاۋاز تونۇش ماتورى بولغان VoxForge ئىشلىتىلىدۇ.

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
ug: بۇ تۈرگە ياردەمدە بولغان تۆۋەندىكى كىشىلەر ۋە تەشكىلاتلارغا رەھمەت ئېيتىمىز: Common Voice نى تېخىمۇ ياخشىلاشقا ياردەمدە بولۇشنى خالامسىز؟ ناھايىتى ياخشى، ئۇنداقتا ئېلخەت ياكى <discourseLink>مۇنازىرە</discourseLink> مۇنبىرى ئارقىلىق ئالاقىلىشىڭ، تور بەتتىكى مەسىلىلەرنى <githubLink>GitHub</githubLink> ياكى <matrixLink>Matrix</matrixLink> گە يوللاڭ.

source: Want to save your information? <createProfile>Create a profile</createProfile>
ug: ئۇچۇرلىرىڭىزنى ساقلىماقچىمۇ؟ <createProfile>تەرجىمىھال قۇرۇش</createProfile>

source: Want to stay in touch with Common Voice?
ug: Common Voice بىلەن ئالاقە ساقلاشنى خالامسىز؟

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
ug: Common Voice ئاۋاز ئامبىرىنىڭ يېڭى نەشرىدىن خەۋەردار بولۇشنى خالامسىز؟يېڭىلىنىشقا مۇشتەرى بولۇڭ.

source: Watch our video explainer to help
ug: ياردەم قىلىش ئۈچۈن سىن چۈشەندۈرگۈچىمىزنى كۆرۈڭ

source: Wayuunaiki
ug: ۋايۇچە

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
ug: بىز ھەمىشە سانلىق مەلۇمات ئىستېمالچىلىرىدىن ئۇلارنىڭ ئېھتىياجى ۋە مەزمۇنىنى بىلىشنى خالايمىز - سانلىق مەلۇمات توپلاش سۇپىسىدا ھەمكارلىشىشتىن تارتىپ، سانلىق مەلۇمات ساغلاملىق چۈشەنچىسى بىلەن تەمىنلەشكىچە، بىز <emailFragment> پىڭرىڭىزنى ئاڭلاشنى خالايمىز.</emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
ug: بىز ئوچۇق ۋە ھەركىم قوللىنالايدىغان سانلىق مەلۇمات ئامبىرىنى قۇرۇپ چىقىۋاتىمىز ، بۇنىڭ بىلەن كۆپچىلىك ئاۋازلىق سۆزلىيەلەيدىغان قوللىنىشچان پروگراممىلارنى مەشىق قىلدۇرالايدۇ.

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
ug: بىز ئاممىۋى تارماقلارنىڭ تېخنىكا، يېڭىلىق يارىتىش ۋە تىل ھوقۇقى بىلەن شۇغۇللىنىشىنى قوللايمىز. ئەگەر سىز بىر چوڭ قۇرۇلۇش ياكى پائالىيەت ئېلىپ بارماقچى بولسىڭىز، <emailFragment> بىز بىلەن ئالاقىلىشىڭ.</emailFragment>

source: We are going out to get a coffee.
ug: بىز بىر قەھۋە ئېلىشقا سىرتقا چىقماقچى.

source: We are going out to get coffee.
ug: بىز قەھۋە ئېلىشقا سىرتقا چىقماقچى.

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
ug: بىز كىشىلەرنىڭ جىنسى ياكى جىنسى كىملىكى ھەققىدە بىزگە نېمىلەرنى دېيىشى ھەققىدە تېخىمۇ كۆپ تاللاش پۇرسىتى بىلەن تەمىنلەۋاتىمىز. ئۆزىڭىزگە ئەڭ تەبىئىي تۇيۇلىدىغان شەكىلدە ئۆزىڭىزنى تەسۋىرلەڭ. <learnMoreLink> جىنس ۋە جىنسقا بولغان قارىشىمىز ھەققىدىكى تەپسىلاتلار. </learnMoreLink>

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
ug: بىز Mozilla دا ئاۋاز تېخنىكىسىنى چۆرىدىگەن ھالدا جامائەت شەكىللەندۈرۈۋاتىمىز. بىز يېڭىلانمىلار ، يېڭى سانلىق مەلۇمات مەنبەلىرى شۇنداقلا بۇ سانلىق مەلۇماتلارنى قانداق ئىشلىتىۋاتقانلىقىڭىزدىن خەۋەردار بولۇپ تۇرۇشنى خالايمىز.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
ug: چوك ھەجىمدىكى ۋە ئېچىۋېتىلگەن ئاۋاز سانلىق مەلۇمات ئاۋاز تونۇش تېخنىكىسىدىكى ماشىنا ئۆگىنىشكە قارىتا يېڭىلىق يارىتىش شۇنداقلا ساغلام بولغان سودا رىقابىتىنى ئىلگىرى سۈرىدىغانلىقىغا ئىشىنىمىز. بۇ دۇنياۋى بىر نىشان بولۇپ، بىز ھەر بىرىڭلارنى ئىشتىراك قىلىشقا تەكلىپ قىلىمىز. بىزنىڭ مەقسىتىمىز ئاۋاز تونۇش تېخنىكىسىنىڭ تېخىمۇ كەڭ دائىرىلىك، دۇنيانىڭ ھەر قايسى جايلىرىدىن كۆپ خىللىقنى ئۆزىگە مۇجەسسەملىگەن بولۇشىغا ياردەمدە بولۇش.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
ug: چوك ھەجىمدىكى ۋە ئىچىۋېتىلگەن ئاۋاز سانلىق مەلۇمات ئاۋاز تونۇش تېخنىكىسىدىكى ماشىنا ئۆگىنىشكە قارىتا يېڭىلىق يارىتىش شۇنداقلا ساغلام بولغان سودا رىقابىتىنى ئىلگىرى سۈرىدىغانلىقىغا ئىشىنىمىز. Common Voice نىڭ كۆپ تىللىق سانلىق مەلۇماتى ئاللىبۇرۇن بۇ خىلىدىكى سانلىق مەلۇمات ئامبىرىدىكى ئەڭ چوڭ ئىچىۋېتىلگەن مەلۇمات بولسىمۇ ئەمما بىردىنبىر ھېسابلانمايدۇ. باشقا ئوچۇق مەنبەلىك ئاۋاز ئامبارلىرى توغرىسىدا Common Voice نىڭ ئۈزلۈكسىز تەرەققىياتىغا ئەگىشىپ بىزنىڭ يېڭىلاش مەركىزىمىز بولۇپ قالغان بۇ بېتىمىزدىن پايدىلىنىڭ.

source: Website Localization
ug: تور بېكەتنى يەرلىكلەشتۈرۈش

source: Websites
ug: تور بېكەتلەر

source: We couldn’t find that page for you
ug: ئىزدىگەن بېتىڭىز تېپىلمىدى

source: We couldn’t get any audio clips for you to listen to. Please try again later.
ug: بىزدە سىزگە ئاڭلاتقۇدەك ھېچقانداق ئاۋاز پارچىسى يوق. سەل تۇرۇپ قايتا سىناڭ.

source: We couldn’t get any sentences for you to speak. Please try again later.
ug: ۋاقتىنچە ئۈنگە ئالىدىغان جۈملە يوق. سەل تۇرۇپ قايتا سىناڭ.

source: Weekly
ug: ھەپتىلىك

source: Weekly Goal
ug: ھەپتىلىك نىشان

source: We launch the Common Voice site in this language.
ug: بىز Common Voice نىڭ تور بېتىنى بۇ تىلدا قوزغىتىمىز.

source: Welcome { $company } staff!
ug: { $company } خىزمەتچىلىرىنى قارشى ئالىمىز!

source: Welcome to Common Voice
ug: Common Voice گە خۇش كەپسىز

source: Welcome to Spontaneous Speech
ug: تەبىئىي سۆھبەتكە خۇش كەلدىڭىز

source: Welsh
ug: ۋېلشچە

source: We may have run out of clips - refresh the page, or try again later.
ug: بۇ تىلدىكى دەلىللەيدىغان ئاۋازلار تۈگىدى...

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
ug: بىز ئۇ تەلەپنى تاپشۇرۇۋالمىغان بولۇشىمىز مۇمكىن. <emailLink>{ $email }</emailLink> ئارقىلىق بىزگە بىۋاسىتە ئېلخەت يازسىڭىز، بىز سىزگە جاۋاب قايتۇرىمىز!

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
ug: ئۇچۇرلىرىڭىزنى ئېھتىياتچانلىق بىلەن بىر تەرەپ قىلىشقا ۋەدە بېرىمىز. تېخىمۇ كۆپ مەزمۇنلارنى <privacyLink> شەخسىيەت ئۇقتۇرۇشى</privacyLink> دىن ئوقۇڭ.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
ug: بىز ئوچۇق كودلۇق بولغان، ھەر قانداق ئادەمنى ئاۋازلىق پروگراممىغا قارىتا مەشىق ئىلىپ بېرىش ئىمكانىيەتكە ئىگە قىلىدىغان كۆپ تىللىق ئاۋاز ئامبىرىنى قۇرۇپ چىقىۋاتىمىز.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
ug: بىز ئوچۇق مەنبەلىك ئاۋاز ئامبىرى توپلاۋاتىمىز. ئاۋازىڭىزنى تەقدىم قىلىڭ، باشقىلارنىڭ ئاۋازىنىڭ توغرىلىقىنى دەلىللەڭ، ھەممەيلەن پايدىلىنىشى ئۈچۈن ئامبارنى تېخىمۇ ياخشىلاڭ.

source: We’re experiencing unexpected downtime
ug: كۈتۈلمىگەن مەسىلە كۆرۈلدى

source: We're going out to get coffee.
ug: بى قەھۋە ئېلىشقا سىرتقا چىقماقچى.

source: We’re going out to get coffee.
ug: بى قەھۋە ئالماقچى.

source: We release the dataset every 3 months.
ug: بىز سانلىق مەلۇمات توپلىمىنى ھەر 3 ئايدا بىر قېتىم تارقىتىمىز.

source: We're making some big changes
ug: بىز بەزى چوڭ ئۆزگەرتىشلەرنى ئېلىپ بېرىۋاتىمىز

source: We're receiving a lot of traffic and are currently investigating the issues.
ug: بىز زور مىقداردىكى زىيارەت ئېقىم بىسىمىغا ئۇچرىدۇق، ھازىر ئالاقىدار مەسىلىلەرنى تەكشۈرۈپ بىر تەرەپ قىلىۋاتىمىز.

source: We’re sorry, your platform is not currently supported.
ug: كەچۈرۈڭ ، سىزنىڭ سۇپىڭىزنى ھازىرچە قوللىمايدۇ.

source: Western Penan
ug: غەربىي پېنان

source: Western Sierra Puebla Nahuatl
ug: غەربىي سىيررا پيېبلا ناخۇئات تىلى

source: Westphalian
ug: غەربىي پالىيانچە

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
ug: بىز تەرجىمە ئۈچۈن <pontoonLink>Pontoon</pontoonLink> دەپ ئاتىلىدىغان Mozilla قورالىنى ئىشلىتىمىز. Pontoon دا نۇرغۇن تىللار بار، ئەمما ئۇنىڭدا تىلىڭىز بولمىسا، <pontoonRequestLink> تىلىڭىزنىڭ قوشۇشنى تەلەپ قىلسىڭىز بولىدۇ</pontoonRequestLink>. ئاندىن، Common Voice قۇرۇلۇشىدا تىلنى ئىشلىتىش ئۈچۈن، <githubRepoLink> GitHub دا يېڭى تىلنى ئىلتىماس قىلىڭ<githubRepoLink>. <localizationFragment> تەپسىلاتىنى تور بەت تەرجىمىسىدىن كۆرۈڭ</localizationFragment>.

source: We’ve made some changes. Delta Segments just contain the most recent clips since the last release. <deltaLink>Read more about this work</deltaLink>.
ug: بىز بەزى ئۆزگەرتىشلەرنى ئېلىپ باردۇق. دېلتا بۆلەكلىرى ئالدىنقى قېتىم ئېلان قىلىنغاندىن بۇيانقى ئەڭ يېڭى ئۈن ئۈزۈندىلىرىنىلا ئۆز ئىچىگە ئالىدۇ. <deltaLink> بۇ خىزمەت ھەققىدە تېخىمۇ كۆپ ئۇچۇرلار </deltaLink>.

source: We've run out of sentences to record in this language...
ug: بۇ تىلدىكى ئۈنگە ئالدىغان جۈملىلەر تۈگىدى...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
ug: بىز ئاۋاز مودېللىرىنىڭ ناھايىتى كۆپ، خىلمۇخىل كىشىلەرنىڭ ئاۋازىنى چۈشىنىشتە تېخىمۇ ياخشى بولۇشىنى ئۈمىد قىلىمىز. بۇنىڭ ئۈچۈن، بىر ئاۋازلىق سانلىق مەلۇمات ئامبىرى چوقۇم ناھايىتى كۆپ، پەرقلىق كىشىلەرگە ۋەكىللىك قىلالىشى كېرەك.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
ug: بىز ماشىنا ئۆگىنىش ھېسابلاش ئۇسۇلىنىڭ ھەر خىل تەگلىك شاۋقۇنلارنى بىر تەرەپ قىلىشىنى ئۈمىد قىلىمىز، ھەتتا تېكىستنىڭ تولۇق ئاڭلىنىشىغا توسقۇنلۇق قىلمىغان ئەھۋالدا، يۇقىرىراق ئاۋازلارنىمۇ قوبۇل قىلىشقا بولىدۇ. لەرزان تەڭكەش نەغمە بولسا بولىدۇ. ئەگەر نەغمەنىڭ يۇقىرى ئاۋازى ھەر بىر سۆزىڭىزنى بېسىپ كەتسە بولمايدۇ.

source: We welcome different accents! Be very cautious before rejecting a clip on the ground that you think the reader has mispronounced a word, has put the stress in the wrong place, or has ignored punctuation. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a generous margin of appreciation for those who may speak differently from you.
ug: بىز پەرقلىق شىۋىلەرنى قارشى ئالىمىز! ئوقۇرمەننىڭ بىر سۆزنى خاتا تەلەپپۇز قىلغانلىقى، ئۇرغۇنى خاتا ئورۇندا چىقارغانلىقى ياكى سوئال بەلگىسىگە سەل قارىغانلىقى تۈپەيلىدىن ئۈن ئۈزۈندىسىنى رەت قىلىشتىن ئېھتىيات قىلىڭ. كىشىلەر دۇنيانىڭ ھەرقايسى جايلىرىدا ھەر خىل شېۋىدە سۆزلىشىدۇ، بۇلارنىڭ بەزىلىرىنى مەھەللىڭىزدە ئاڭلاپ باقمىغان بولۇشىڭىز مۇمكىن. سىزدىن پەرقلىق سۆزلىيەلەيدىغانلارغا مىننەتدارلىق بىلدۈرۈڭ.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
ug: بىز <strong>مەھەللە باشقۇرغۇچىمىزغا سىزنىڭمۇ قىزىقىدىغانلىقىڭىزنى بىلدۈرىمىز</strong>، بۇنداق بولغاندا سىز ئېھتىياجلىق بولغان خالىغان قوشۇمچە قوللاش ۋە ئۇچۇرلارنى سىزگە بېرەلىشى مۇمكىن.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
ug: Common Voice قا تىلىڭىزنى قانداق قوشۇش توغرىسىدا پات يېقىندا سىزنى تېخىمۇ كۆپ ئۇچۇر بىلەن تەمىنلەيمىز.

source: We will be in touch with more information as it becomes available.
ug: ئىلگىرىلەش بولغاندا تەپسىلاتى ئۈچۈن سىز بىلەن ئالاقە قىلىمىز.

source: We will not make your email public.
ug: بىز ئېلخەتلىرىڭىزنى ئاشكارىلىمايمىز.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
ug: ئۈن خاتىرىڭىزنى سانلىق مەلۇمات ئامبىرىدىن ئۆچۈرۈۋېتىش تەلىپىڭىزنى كۆزدىن كەچۈرىمىز. ئەگەر تەلىپىڭىز تەستىقلانسا ، سانلىق مەلۇماتنى چۈشۈرگەنلەر بىلەن ئالاقىلىشىپ ئۇلاردىن سىزنىڭ ئۈن خاتىرىڭىزنى ئۆچۈرۈۋېتىشنى تەلەپ قىلىمىز.

source: We work with foundations, civil society and community partners to make the internet a healthier place, with a particular focus on East Africa. Learn more about our <programmaticWork>programmatic work.</programmaticWork>
ug: بىز فوندى جەمئىيىتى، پۇقرالار جەمئىيىتى ۋە جامائەت شېرىكلىرى بىلەن ھەمكارلىشىپ، ئىنتېرنېتنى تېخىمۇ ساغلام جايغا ئايلاندۇرىمىز، شەرقىي ئافرىقىغا ئالاھىدە ئەھمىيەت بېرىمىز. بىزنىڭ <programmaticWork> پروگرامما خاراكتېرلىك خىزمىتىمىز</programmaticWork> ھەققىدىكى تېخىمۇ كۆپ تەپسىلاتلار.

source: What is a language on Common Voice?
ug: Common Voice دا قايسى تىل بار؟

source: What issues are you experiencing with this content?
ug: بۇ مەسىلىگە ئائىت قانداق مەسىلىگە يولۇقتىڭىز؟

source: What issues are you experiencing with this sentence?
ug: بۇ جۈملىدە قانداق مەسىلىلەرگە دۇچ كەلدىڭىز؟

source: What is your age?
ug: يېشىڭىز؟

source: What is your sex or gender?
ug: جىنسىڭىز ياكى جىس تەۋەلىكىڭىز نېمە؟

source: What kind of goal do you want to build?
ug: سىز قانداق نىشان تىكلىمەكچى؟

source: What needs to be in my file?
ug: ھۆججىتىمدە نېمە بولۇشى كېرەك؟

source: What sentences can I add?
ug: قانداق جۈملىلەرنى قوشالايمەن؟

source: What’s inside the Common Voice dataset?
ug: Common Voice مەلۇمات ئامبىرىدا نېمە بار؟

source: What's Public?
ug: قايسى ئۇچۇرلار ئاشكارا بولىدۇ؟

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
ug: ئاۋاز ئىشلەتكۈچى تەرىپىدىن رەت قىلىنسا قاتارغا قايتۇرۇلىدۇ، ئەگەر ئىككىنچى قېتىم رەت قىلىنسا ئاۋاز قەبرىستانلىقىغا يۆتكىلىدۇ.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
ug: ئاڭلىغاندا، ئۈنگە خاتىرىلەنگەننىڭ يېزىلغىنى ئىكەنلىكىنى ئىنتايىن ئىنچىكىلىك بىلەن تەكشۈرۈڭ. كىچىككىنە خاتالىق بولسىمۇ رەت قىلىڭ.<br /> ئىنتايىن كۆپ ئۇچرايدىغان خاتالىقلار:

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
ug: ئۈن خاتىرىلىرىڭىزنى تەلەپ قىلسىڭىز، ئۇلارنى بىر ياكى بىر قانچە ZIP ھۆججىتىگە توپلايمىز. ئىلگىرىكى ئىلتىماسلىرىڭىز:

source: Which variant of { $language } do you speak?
ug: سىز قايسى{ $language }دا سۆزلەيسىز؟

source: Why ?
ug: نېمىشقا؟

source: Why a profile?
ug: نېمە ئۈچۈن تەرجىمىھال قۇرۇلىدۇ؟

source: Why are you asking?
ug: نېمىشقا سورايسىز؟

source: Why Common Voice?
ug: نېمە ئۈچۈن Common Voice؟

source: Why does this matter?
ug: بۇ نېمە ئۈچۈن مۇھىم؟

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
ug: تەرجىمىھال ئارقىلىق پائالىيىتىڭىزنى ئىزلاپ، ئاۋاز سانلىق مەلۇمات ئىجادكارلار جامائىتى بىلەن باغلىنالايسىز.

source: Wixarika
ug: ۋىكسارىكا

source: Wolof
ug: ۋولوفچە

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
ug: ئۈن خاتىرىڭىزنىڭمۇ ئۆچۈرۈۋېتىلىشىنى تەلەپ قىلامسىز ياكى ئاۋازلارنى Common Voice سانلىق مەلۇمات ئامبىرىدا ساقلاپ قىلىشنى خالامسىز؟

source: Write
ug: يازاي

source: Write down what you hear the person saying here
ug: بۇ جايغا ئاڭلىغىنىڭىزنى يېزىڭ

source: Write options menu
ug: تاللانما تىزىملىكنى يازىدۇ

source: Xhosa
ug: خوساچە

source: Xitsonga
ug: سونگاچە

source: Yes
ug: ھەئە

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
ug: ھەئە ، ماڭا ئېلخەت ئەۋەتىڭ. مەن Common Voice تۈرى ھەققىدە داۋاملىق خەۋەردار بولۇشنى خالايمەن.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
ug: ھەئە ، ماڭا ئېلخەت ئەۋەتىڭ. مەن بۇ تىلنىڭ Common Voice دىكى ئىلگىرىلەش ئەھۋالىدىن خەۋەردار بولۇشنى خالايمەن.

source: Yiddish
ug: يىددىشچە

source: Yoruba
ug: يورۇباچە

source: You
ug: سىز

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
ug: سىز <size>{ $size }GB</size> نى چۈشۈرۈشنى باشلىماقچى بولۇۋاتىسىز؟

source: You are prepared to initiate a download of <b>{ $size }</b>
ug: <b>{ $size }</b> نى چۈشۈرۈشنى باشلاشقا بولىدۇ

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
ug: <writePageLink>يازاي بەت</writePageLink> تە جۈملە قوشالايسىز ياكى <reviewPageLink>تەكشۈرەي بەت</reviewPageLink> تە جۈملىلەرنى تەكشۈرەلەيسىز.

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
ug: بىۋاسىتە URLs نى ئۆزىڭىز ياقتۇرىدىغان چۈشۈرۈش باشقۇرغۇچقىمۇ كۆچۈرۈپ چاپلىيالايسىز. ئۇلارنىڭ ۋاقتى 12 سائەتتە توشىدۇ ئەمما سىز بۇ بەتكە قايتىپ يېڭىسىنى خالىغان ۋاقىتتا ھاسىل قىلالايسىز.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
ug: سىز ھەرپتاختا قىسقا يولىنى ئىشلىتەلەيسىز: { sc-review-form-button-approve-shortcut } كۇنۇپكىسى تەستىقلاش، { sc-review-form-button-reject-shortcut } كۇنۇپكىسى رەت قىلىش، { sc-review-form-button-skip-shortcut } كۇنۇپكىسى ئاتلاش

source: You can choose to make your username public or anonymous.
ug: ئىشلەتكۈچى ئىسمىڭىزنى ئاشكارا قىلىش ياكى نامسىز قىلىشنى تاللىيالايسىز.

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
ug: سىز <datasetsPage> سانلىق مەلۇمات توپلىمى بېتى</datasetsPage> گە يۆتكىلىپ، سىزگە لازىملىق نەشرى ۋە تىل (لار) نى تاللاپ چۈشۈرەلەيسىز! بۇ ھۆججەتلەردە نوپۇس ئۇچۇرى ۋە دەلىللەش سانلىق مەلۇماتلىرىغا ئوخشاش <metadataLink>مۇناسىۋەتلىك مېتا سانلىق مەلۇماتى</metadataLink> بار. سانلىق مەلۇمات توپلىمىنى چۈشۈرۈش ئۈچۈن ئېلخەت ئادرېسى بىلەن تەمىنلىشىڭىز كېرەك.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
ug: Common Voice تەرجىمىھالى قۇرۇش ۋە ئاۋازىڭىزدا تۆھپە قوشۇش ئارقىلىق كۆپ خىل، ئوچۇق كودلۇق سانلىق مەلۇمات جەدۋىلى قۇرۇشقا ياردەم بېرەلەيسىز.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
ug: مۇھىم سۆھبەتلەر ئۈچۈن <discourseLink> Discourse </discourseLink> غا، ياكى تېزلا مەسلىھەت سوراش ئۈچۈن <matrixLink> Matrix </matrixLink> غا قوشۇلسىڭىز، Mozilla تىل مەھەللىسىدىكى باشقىلار بىلەن كۆرۈشەلەيسىز.

source: You cannot add multiple sentences for a single submission
ug: بىر قېتىملىق يوللاشتا كۆپ جۈملە قوشۇپ يوللىيالمايسىز

source: You cannot request your recordings while another request is already in progress.
ug: باشقا تەلەپلەر داۋاملىشىۋاتقاندا خاتىرىلىرىڭىزنى تەلەپ قىلالمايسىز.
